[
  {
    "quote": "Computer science is no more about computers than astronomy is about telescopes.",
    "author": "Edsger Dijkstra"
  },

  {
    "quote": "People think that computer science is the art of geniuses but the actual reality is the opposite, just many people doing things that build on each other, like a wall of mini stones.",
    "author": "Donald Knuth"
  },

  {
    "quote": "If we suppose that many natural phenomena are in effect computations, the study of computer science can tell us about the kinds of natural phenomena that can occur.",
    "author": "Rudy Rucker"
  },

  {
    "quote": "Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.",
    "author": "Brian Kernighan and P.J. Plauger"
  },

  {
    "quote": "The key to performance is elegance, not battalions of special cases.",
    "author": "Jon Bentley and Doug McIlroy"
  },

  {
    "quote": "There are two ways of constructing a software design: One way is to make it so simple that there are obviously no deficiencies, and the other way is to make it so complicated that there are no obvious deficiencies.",
    "author": "C.A.R. Hoare"
  },

  {
    "quote": "The problem with object-oriented languages is they’ve got all this implicit environment that they carry around with them. You wanted a banana but what you got was a gorilla holding the banana and the entire jungle.",
    "author": "Joe Armstrong"
  },

  {
    "quote": "Some people, when confronted with a problem, think ‘I know, I’ll use regular expressions.’ Now they have two problems.",
    "author": "Jamie Zawinski"
  },

  {
    "quote": "It has been said that the great scientific disciplines are examples of giants standing on the shoulders of other giants.  It has also been said that the software industry is an example of midgets standing on the toes of other midgets.",
    "author": "Alan Cooper"
  },

  {
    "quote": "There’s an old story about the person who wished his computer were as easy to use as his telephone.  That wish has come true, since I no longer know how to use my telephone.",
    "author": "Bjane Stroustrup"
  },

  {
    "quote": "There are only two industries that refer to their customers as ‘users’.",
    "author": "Edward Tufte"
  }
]